org/RforS-2.org
* Rで一変数の記述統計
  
** 目標

   R で書かれたコードを読めるようになりましょう。

   - データフレーム，ベクトル，リストを知りましょう
   - 記述統計の計算をしてみましょう     

** 1つの変数の記述統計 ーー 教科書2章
   
*** Rに組込まれたデータセット iris
    - [[https://bioinfo-dojo.net/2016/01/19/dataset_iris/][R 使い方 組込みデータセット iris データフレーム]]
    - petal: はなびら
    - sepal: がく

