docs/RforS-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-26 水 06:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga3902cd">1. Rで一変数の記述統計</a>
<ul>
<li><a href="#org979759c">1.1. 目標</a></li>
<li><a href="#orgb2df393">1.2. 1つの変数の記述統計 ーー 教科書2章</a>
<ul>
<li><a href="#org407ec1b">1.2.1. Rに組込まれたデータセット iris</a></li>
<li><a href="#org30a8726">1.2.2. データセットの特徴</a></li>
<li><a href="#org5fc2fe6">1.2.3. 平均 (教科書2.5)</a></li>
<li><a href="#org41ba666">1.2.4. 散布度， 分散，標準偏差 &#x2013; 教科書 2.7~2.8</a></li>
<li><a href="#org9a82619">1.2.5. 標準化</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga3902cd" class="outline-2">
<h2 id="orga3902cd"><span class="section-number-2">1</span> Rで一変数の記述統計</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org979759c" class="outline-3">
<h3 id="org979759c"><span class="section-number-3">1.1</span> 目標</h3>
<div class="outline-text-3" id="text-1-1">
<p>
R で書かれたコードを読めるようになりましょう。
</p>

<ul class="org-ul">
<li>データフレーム，ベクトル，リストを知りましょう</li>
<li>記述統計の計算をしてみましょう</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2df393" class="outline-3">
<h3 id="orgb2df393"><span class="section-number-3">1.2</span> 1つの変数の記述統計 ーー 教科書2章</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org407ec1b" class="outline-4">
<h4 id="org407ec1b"><span class="section-number-4">1.2.1</span> Rに組込まれたデータセット iris</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="https://bioinfo-dojo.net/2016/01/19/dataset_iris/">R 使い方 組込みデータセット iris データフレーム</a></li>
<li>petal: はなびら</li>
<li>sepal: がく</li>
</ul>
</div>

<ol class="org-ol">
