org/RforS-2.org
**** iris の型
     
#+begin_src R :session t :results output :exports both

class(iris)

#+end_src

#+RESULTS:
: [1] "data.frame"

**** iris を文字列化

     -str- は構造をもつ (structual) データを文字列化 (serial) する
     
#+begin_src R :session t :results output :exports both

str(iris)

#+end_src

#+RESULTS:
: 'data.frame':	150 obs. of  5 variables:
:  $ Sepal.Length: num  5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
:  $ Sepal.Width : num  3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
:  $ Petal.Length: num  1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
:  $ Petal.Width : num  0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
:  $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...

#+begin_src R :session t :results output :exports both

iris[,"Sepal.Length"]

#+end_src

#+begin_src R :session t :results output :exports both

iris$Sepal.Length

#+end_src

#+begin_src R :session t :results output :exports both

iris[1,]

#+end_src
#+begin_src R :session t :results output :exports both

iris[,1]

#+end_src

#+RESULTS:
:   [1] 5.1 4.9 4.7 4.6 5.0 5.4 4.6 5.0 4.4 4.9 5.4 4.8 4.8 4.3 5.8 5.7 5.4 5.1
:  [19] 5.7 5.1 5.4 5.1 4.6 5.1 4.8 5.0 5.0 5.2 5.2 4.7 4.8 5.4 5.2 5.5 4.9 5.0
:  [37] 5.5 4.9 4.4 5.1 5.0 4.5 4.4 5.0 5.1 4.8 5.1 4.6 5.3 5.0 7.0 6.4 6.9 5.5
:  [55] 6.5 5.7 6.3 4.9 6.6 5.2 5.0 5.9 6.0 6.1 5.6 6.7 5.6 5.8 6.2 5.6 5.9 6.1
:  [73] 6.3 6.1 6.4 6.6 6.8 6.7 6.0 5.7 5.5 5.5 5.8 6.0 5.4 6.0 6.7 6.3 5.6 5.5
:  [91] 5.5 6.1 5.8 5.0 5.6 5.7 5.7 6.2 5.1 5.7 6.3 5.8 7.1 6.3 6.5 7.6 4.9 7.3
: [109] 6.7 7.2 6.5 6.4 6.8 5.7 5.8 6.4 6.5 7.7 7.7 6.0 6.9 5.6 7.7 6.3 6.7 7.2
: [127] 6.2 6.1 6.4 7.2 7.4 7.9 6.4 6.3 6.1 7.7 6.3 6.4 6.0 6.9 6.7 6.9 5.8 6.8
: [145] 6.7 6.7 6.3 6.5 6.2 5.9

**** ベクトル

#+begin_src R :session t :results output :exports both

iris[,"Sepal.Length"]

#+end_src

***** ベクトル
      
#+begin_src R :session t :results output :exports both

class(iris[,"Sepal.Length"])

#+end_src

#+RESULTS:
: [1] "numeric"

***** リスト

#+begin_src R :session t :results output :exports both

class(iris[1,])

#+end_src

#+RESULTS:
: [1] "data.frame"

*** データセットの特徴

**** 次元
 #+begin_src R :session t :results output :exports both

dim(iris)

 #+end_src

 #+RESULTS:
 : [1] 150   5
 
**** 行数
#+begin_src R :session t :results output :exports both

nrow(iris)

#+end_src

**** 列数

#+begin_src R :session t :results output :exports both

ncolumn(iris)

#+end_src


**** 要約統計量

#+begin_src R :session t :results output :exports both

summary(iris)

#+end_src

#+RESULTS:
#+begin_example
  Sepal.Length    Sepal.Width     Petal.Length    Petal.Width   
 Min.   :4.300   Min.   :2.000   Min.   :1.000   Min.   :0.100  
 1st Qu.:5.100   1st Qu.:2.800   1st Qu.:1.600   1st Qu.:0.300  
 Median :5.800   Median :3.000   Median :4.350   Median :1.300  
 Mean   :5.843   Mean   :3.057   Mean   :3.758   Mean   :1.199  
 3rd Qu.:6.400   3rd Qu.:3.300   3rd Qu.:5.100   3rd Qu.:1.800  
 Max.   :7.900   Max.   :4.400   Max.   :6.900   Max.   :2.500  
       Species  
 setosa    :50  
 versicolor:50  
 virginica :50
#+end_example

#+begin_src R :session t :results output :exports both

summary(iris$Sepal.Length)

#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:   4.300   5.100   5.800   5.843   6.400   7.900

**** 度数 (頻度) 分布表 -- ヒストグラム
     
#+begin_src R :session t :results output :exports both

hist(iris$Sepal.Length,breaks=100)

#+end_src

#+RESULTS:

*** 平均 (教科書2.5)
    

**** データの代表値
     - Min. ::  最小値
     - 1st Qu. :: 第一四分位数 (下から1/4点)
     - Median :: 中央値
     - Mean :: 平均値
     - 3rd Qu. :: 第三四分位数 (下から3/4点)
     - Max. :: 最大値

**** 平均 (mean)
     
#+begin_src R :session t :results output :exports both
my.mean <- function (v) {
  sum(v)/length(v)
}

my.mean(iris$Sepal.Length)
mean(iris$Sepal.Length)

#+end_src

#+RESULTS:
: [1] 5.843333
: [1] 5.843333
     
**** 中央値 (median)

#+begin_src R :session t :results output :exports both

median(iris$Sepal.Length)

#+end_src

#+RESULTS:
: [1] 5.8

**** 最頻値 (median)

#+begin_src R :session t :results output :exports both

table(iris$Sepal.Length)

#+end_src

#+RESULTS:
: 
: 4.3 4.4 4.5 4.6 4.7 4.8 4.9   5 5.1 5.2 5.3 5.4 5.5 5.6 5.7 5.8 5.9   6 6.1 6.2 
:   1   3   1   4   2   5   6  10   9   4   1   6   7   6   8   7   3   6   6   4 
: 6.3 6.4 6.5 6.6 6.7 6.8 6.9   7 7.1 7.2 7.3 7.4 7.6 7.7 7.9 
:   9   7   5   2   8   3   4   1   1   3   1   1   1   4   1


#+begin_src R :session t :results output :exports both

hist(iris$Sepal.Length, breaks=100)

#+end_src

#+RESULTS:

*** 散布度， 分散，標準偏差 -- 教科書 2.7~2.8

    - 代表値 :: 分布の中心的位置を示す
    - 散布度 :: 分布の，中心からの，散らばり，ばらつき
                分散，標準偏差

**** データ
#+begin_src R :session t :results output :exports both

(テストa <- c(10, 13, 8, 15, 8))

#+end_src

#+RESULTS:
: [1] 10 13  8 15  8

**** 平均
#+begin_src R :session t :results output :exports both

10+13+8+15+8

sum(テストa) # ベクトルの要素の和

#+end_src

#+RESULTS:
: [1] 54
: [1] 54

#+begin_src R :session t :results output :exports both

sum(テストa) /length(テストa)

#+end_src

#+RESULTS:
: [1] 10.8

#+begin_src R :session t :results output :exports both

(テストaの平均 <- mean(テストa))

#+end_src

#+RESULTS:
: [1] 10.8

**** 平均からの偏差

 #+begin_src R :session t :results output :exports both

(平均からの偏差 <- テストa - テストaの平均) # (ベクトル - 数値) の結果はベクトル!

 #+end_src

 #+RESULTS:
 : [1] -0.8  2.2 -2.8  4.2 -2.8

**** 平均からの偏差の二乗
     
#+begin_src R :session t :results output :exports both

(平均からの偏差の二乗 <- 平均からの偏差^2) # (べくとる)^2 は要素の2乗のベクトル!

#+end_src

#+RESULTS:
: [1]  0.64  4.84  7.84 17.64  7.84

**** データ数
#+begin_src R :session t :results output :exports both

(データ数 <- length(テストa))

#+end_src

#+RESULTS:
: [1] 5

#+begin_src R :session t :results output :exports both

(平均からの偏差の二乗 <- 平均からの偏差^2) # (べくとる)^2 は要素の2乗のベクトル!

#+end_src

#+RESULTS:
: [1]  0.64  4.84  7.84 17.64  7.84

**** 平均からの偏差の二乗和

#+begin_src R :session t :results output :exports both

(平均からの偏差の二乗和 <- sum(平均からの偏差の二乗))

#+end_src

#+RESULTS:
: [1] 38.8
     
**** 分散

#+begin_src R :session t :results output :exports both

(分散 <- 平均からの偏差の二乗和/データ数)

#+end_src

#+RESULTS:
: [1] 7.76

これまでの操作を関数にまとめると，


#+begin_src R :session t :results output :exports both
my.分散 <- function(v){
  sum((v - mean(v))^2)/length(v)
}

(分散 <- my.分散(テストa))

 #+end_src

 #+RESULTS:
 : [1] 7.76
     
      
**** 標準偏差

     標準偏差は，各データの平均からの距離の平均です。
     $\mbox{準偏差} \sigma = \sqrt{\sigma^2}$です。


#+begin_src R :session t :results output :exports both

(標準偏差 <- sqrt(分散))

#+end_src

#+RESULTS:
: [1] 2.785678

