docs/RforS-2.html

<li><a id="org022cb82"></a>iris の型<br />
<div class="outline-text-5" id="text-1-2-1-2">
<div class="org-src-container">
<pre class="src src-R">
class(iris)

</pre>
</div>

<pre class="example">
[1] "data.frame"
</pre>
</div>
</li>

<li><a id="orgfbb51f7"></a>iris を文字列化<br />
<div class="outline-text-5" id="text-1-2-1-3">
<p>
-str- は構造をもつ (structual) データを文字列化 (serial) する
</p>

<div class="org-src-container">
<pre class="src src-R">
str(iris)

</pre>
</div>

<pre class="example">
'data.frame':	150 obs. of  5 variables:
 $ Sepal.Length: num  5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
 $ Sepal.Width : num  3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
 $ Petal.Length: num  1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
 $ Petal.Width : num  0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
 $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...
</pre>


<div class="org-src-container">
<pre class="src src-R">
iris[,"Sepal.Length"]

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
iris$Sepal.Length

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">
iris[1,]

</pre>
</div>
<div class="org-src-container">
<pre class="src src-R">
iris[,1]

</pre>
</div>

<pre class="example">
  [1] 5.1 4.9 4.7 4.6 5.0 5.4 4.6 5.0 4.4 4.9 5.4 4.8 4.8 4.3 5.8 5.7 5.4 5.1
 [19] 5.7 5.1 5.4 5.1 4.6 5.1 4.8 5.0 5.0 5.2 5.2 4.7 4.8 5.4 5.2 5.5 4.9 5.0
 [37] 5.5 4.9 4.4 5.1 5.0 4.5 4.4 5.0 5.1 4.8 5.1 4.6 5.3 5.0 7.0 6.4 6.9 5.5
 [55] 6.5 5.7 6.3 4.9 6.6 5.2 5.0 5.9 6.0 6.1 5.6 6.7 5.6 5.8 6.2 5.6 5.9 6.1
 [73] 6.3 6.1 6.4 6.6 6.8 6.7 6.0 5.7 5.5 5.5 5.8 6.0 5.4 6.0 6.7 6.3 5.6 5.5
 [91] 5.5 6.1 5.8 5.0 5.6 5.7 5.7 6.2 5.1 5.7 6.3 5.8 7.1 6.3 6.5 7.6 4.9 7.3
[109] 6.7 7.2 6.5 6.4 6.8 5.7 5.8 6.4 6.5 7.7 7.7 6.0 6.9 5.6 7.7 6.3 6.7 7.2
[127] 6.2 6.1 6.4 7.2 7.4 7.9 6.4 6.3 6.1 7.7 6.3 6.4 6.0 6.9 6.7 6.9 5.8 6.8
[145] 6.7 6.7 6.3 6.5 6.2 5.9
</pre>
</div>
</li>

<li><a id="orgce6614e"></a>ベクトル<br />
<div class="outline-text-5" id="text-1-2-1-4">
<div class="org-src-container">
<pre class="src src-R">
iris[,"Sepal.Length"]

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgcd8425b"></a>ベクトル<br />
<div class="outline-text-6" id="text-1-2-1-4-1">
<div class="org-src-container">
<pre class="src src-R">
class(iris[,"Sepal.Length"])

</pre>
</div>

<pre class="example">
[1] "numeric"
</pre>
</div>
</li>

<li><a id="org2c64061"></a>リスト<br />
<div class="outline-text-6" id="text-1-2-1-4-2">
<div class="org-src-container">
<pre class="src src-R">
class(iris[1,])

</pre>
</div>

<pre class="example">
[1] "data.frame"
</pre>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org30a8726" class="outline-4">
<h4 id="org30a8726"><span class="section-number-4">1.2.2</span> データセットの特徴</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org42e79d9"></a>次元<br />
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-R">
dim(iris)

</pre>
</div>

<pre class="example">
[1] 150   5
</pre>
</div>
</li>

<li><a id="org4b8fa64"></a>行数<br />
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">
<pre class="src src-R">
nrow(iris)

</pre>
</div>
</div>
</li>

<li><a id="orgf2fa10a"></a>列数<br />
<div class="outline-text-5" id="text-1-2-2-3">
<div class="org-src-container">
<pre class="src src-R">
ncolumn(iris)

</pre>
</div>
</div>
</li>


<li><a id="orgcefb06c"></a>要約統計量<br />
<div class="outline-text-5" id="text-1-2-2-4">
<div class="org-src-container">
<pre class="src src-R">
summary(iris)

</pre>
</div>

<pre class="example" id="orga025276">
 Sepal.Length    Sepal.Width     Petal.Length    Petal.Width   
Min.   :4.300   Min.   :2.000   Min.   :1.000   Min.   :0.100  
1st Qu.:5.100   1st Qu.:2.800   1st Qu.:1.600   1st Qu.:0.300  
Median :5.800   Median :3.000   Median :4.350   Median :1.300  
Mean   :5.843   Mean   :3.057   Mean   :3.758   Mean   :1.199  
3rd Qu.:6.400   3rd Qu.:3.300   3rd Qu.:5.100   3rd Qu.:1.800  
Max.   :7.900   Max.   :4.400   Max.   :6.900   Max.   :2.500  
      Species  
setosa    :50  
versicolor:50  
virginica :50
</pre>

<div class="org-src-container">
<pre class="src src-R">
summary(iris$Sepal.Length)

</pre>
</div>

<pre class="example">
 Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
4.300   5.100   5.800   5.843   6.400   7.900
</pre>
</div>
</li>

<li><a id="orgbbdf99a"></a>度数 (頻度) 分布表 &#x2013; ヒストグラム<br />
<div class="outline-text-5" id="text-1-2-2-5">
<div class="org-src-container">
<pre class="src src-R">
hist(iris$Sepal.Length,breaks=100)

</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5fc2fe6" class="outline-4">
<h4 id="org5fc2fe6"><span class="section-number-4">1.2.3</span> 平均 (教科書2.5)</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="org244968a"></a>データの代表値<br />
<div class="outline-text-5" id="text-1-2-3-1">
<dl class="org-dl">
<dt>Min.</dt><dd>最小値</dd>
<dt>1st Qu.</dt><dd>第一四分位数 (下から1/4点)</dd>
<dt>Median</dt><dd>中央値</dd>
<dt>Mean</dt><dd>平均値</dd>
<dt>3rd Qu.</dt><dd>第三四分位数 (下から3/4点)</dd>
<dt>Max.</dt><dd>最大値</dd>
</dl>
</div>
</li>

<li><a id="org10bced9"></a>平均 (mean)<br />
<div class="outline-text-5" id="text-1-2-3-2">
<div class="org-src-container">
<pre class="src src-R">my.mean &lt;- function (v) {
  sum(v)/length(v)
}

my.mean(iris$Sepal.Length)
mean(iris$Sepal.Length)

</pre>
</div>

<pre class="example">
[1] 5.843333
[1] 5.843333
</pre>
</div>
</li>

<li><a id="org0f155e9"></a>中央値 (median)<br />
<div class="outline-text-5" id="text-1-2-3-3">
<div class="org-src-container">
<pre class="src src-R">
median(iris$Sepal.Length)

</pre>
</div>

<pre class="example">
[1] 5.8
</pre>
</div>
</li>

<li><a id="orgba56ad0"></a>最頻値 (median)<br />
<div class="outline-text-5" id="text-1-2-3-4">
<div class="org-src-container">
<pre class="src src-R">
table(iris$Sepal.Length)

</pre>
</div>

<pre class="example">

4.3 4.4 4.5 4.6 4.7 4.8 4.9   5 5.1 5.2 5.3 5.4 5.5 5.6 5.7 5.8 5.9   6 6.1 6.2 
  1   3   1   4   2   5   6  10   9   4   1   6   7   6   8   7   3   6   6   4 
6.3 6.4 6.5 6.6 6.7 6.8 6.9   7 7.1 7.2 7.3 7.4 7.6 7.7 7.9 
  9   7   5   2   8   3   4   1   1   3   1   1   1   4   1
</pre>



<div class="org-src-container">
<pre class="src src-R">
hist(iris$Sepal.Length, breaks=100)

</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org41ba666" class="outline-4">
<h4 id="org41ba666"><span class="section-number-4">1.2.4</span> 散布度， 分散，標準偏差 &#x2013; 教科書 2.7~2.8</h4>
<div class="outline-text-4" id="text-1-2-4">
<dl class="org-dl">
<dt>代表値</dt><dd>分布の中心的位置を示す</dd>
<dt>散布度</dt><dd>分布の，中心からの，散らばり，ばらつき
分散，標準偏差</dd>
</dl>
</div>

<ol class="org-ol">
<li><a id="org351bf22"></a>データ<br />
<div class="outline-text-5" id="text-1-2-4-1">
<div class="org-src-container">
<pre class="src src-R">
(テストa &lt;- c(10, 13, 8, 15, 8))

</pre>
</div>

<pre class="example">
[1] 10 13  8 15  8
</pre>
</div>
</li>

<li><a id="orgfea7afc"></a>平均<br />
<div class="outline-text-5" id="text-1-2-4-2">
<div class="org-src-container">
<pre class="src src-R">
10+13+8+15+8

sum(テストa) # ベクトルの要素の和

</pre>
</div>

<pre class="example">
[1] 54
[1] 54
</pre>


<div class="org-src-container">
<pre class="src src-R">
sum(テストa) /length(テストa)

</pre>
</div>

<pre class="example">
[1] 10.8
</pre>


<div class="org-src-container">
<pre class="src src-R">
(テストaの平均 &lt;- mean(テストa))

</pre>
</div>

<pre class="example">
[1] 10.8
</pre>
</div>
</li>

<li><a id="org9b5144f"></a>平均からの偏差<br />
<div class="outline-text-5" id="text-1-2-4-3">
<div class="org-src-container">
<pre class="src src-R">
(平均からの偏差 &lt;- テストa - テストaの平均) # (ベクトル - 数値) の結果はベクトル!

</pre>
</div>

<pre class="example">
[1] -0.8  2.2 -2.8  4.2 -2.8
</pre>
</div>
</li>

<li><a id="org138653b"></a>平均からの偏差の二乗<br />
<div class="outline-text-5" id="text-1-2-4-4">
<div class="org-src-container">
<pre class="src src-R">
(平均からの偏差の二乗 &lt;- 平均からの偏差^2) # (べくとる)^2 は要素の2乗のベクトル!

</pre>
</div>

<pre class="example">
[1]  0.64  4.84  7.84 17.64  7.84
</pre>
</div>
</li>

<li><a id="org393da08"></a>データ数<br />
<div class="outline-text-5" id="text-1-2-4-5">
<div class="org-src-container">
<pre class="src src-R">
(データ数 &lt;- length(テストa))

</pre>
</div>

<pre class="example">
[1] 5
</pre>


<div class="org-src-container">
<pre class="src src-R">
(平均からの偏差の二乗 &lt;- 平均からの偏差^2) # (べくとる)^2 は要素の2乗のベクトル!

</pre>
</div>

<pre class="example">
[1]  0.64  4.84  7.84 17.64  7.84
</pre>
</div>
</li>

<li><a id="orgce1aa53"></a>平均からの偏差の二乗和<br />
<div class="outline-text-5" id="text-1-2-4-6">
<div class="org-src-container">
<pre class="src src-R">
(平均からの偏差の二乗和 &lt;- sum(平均からの偏差の二乗))

</pre>
</div>

<pre class="example">
[1] 38.8
</pre>
</div>
</li>

<li><a id="orgcfe9e56"></a>分散<br />
<div class="outline-text-5" id="text-1-2-4-7">
<div class="org-src-container">
<pre class="src src-R">
(分散 &lt;- 平均からの偏差の二乗和/データ数)

</pre>
</div>

<pre class="example">
[1] 7.76
</pre>


<p>
これまでの操作を関数にまとめると，
</p>


<div class="org-src-container">
<pre class="src src-R">my.分散 &lt;- function(v){
  sum((v - mean(v))^2)/length(v)
}

(分散 &lt;- my.分散(テストa))

</pre>
</div>

<pre class="example">
[1] 7.76
</pre>
</div>
</li>


<li><a id="org6438bb8"></a>標準偏差<br />
<div class="outline-text-5" id="text-1-2-4-8">
<p>
標準偏差は，各データの平均からの距離の平均です。
$\mbox{準偏差} &sigma; = \sqrt{\sigma^2}$です。
</p>


<div class="org-src-container">
<pre class="src src-R">
(標準偏差 &lt;- sqrt(分散))

</pre>
</div>

<pre class="example">
[1] 2.785678
</pre>
</div>
</li>
</ol>
</div>
